[
{"sign": "aries", "day": "yesterday", "horoscope": "This is probably one of your favorite times of the year. Everyone is a bit more sociable -- and even the meekest among us are a lot more willing to try something new, at least once. Now, you've never needed any prodding when it comes to experimentation, so you'll be even more impetuous, impulsive and risk-loving than usual. Sure, it's hard to believe, but it's true, and you'll enjoy every minute -- especially now that you have a playmate who's equally game."},
{"sign": "gemini", "day": "yesterday", "horoscope": "All of a sudden, you're feeling quite emotional -- and even showing your feelings in public. This isn't what you're usually known for, so you may be a bit embarrassed, but don't stop yourself. We all need to express our feelings. When you feel your eyes begin to well up with tears, let them fall -- even if it's a song that inspired them."},
{"sign": "cancer", "day": "yesterday", "horoscope": "The way you're feeling now -- secretive, but with a burning need to tell someone what's on your mind and in your heart -- there's really only one thing to do. Get to your most trusted confidante and tell them you'll need at least an hour. You know that once they hear your voice you won't even have to ask them to listen."},
{"sign": "taurus", "day": "yesterday", "horoscope": "No other sign enjoys shopping like yours under the current astral energy. Of course, you've probably been trying to go easy in that department since you're still trying to pay off the credit card bills from this time last year, but now, your skills are needed. You've been called upon to teach a shopping-challenged friend how to compare, haggle and be in the right place at the right time to scoop the absolute best deal."},
{"sign": "leo", "day": "yesterday", "horoscope": "Your friends -- the ones who've been tried and true for years now -- are expecting you to join them tonight. Unfortunately, you're tempted to go along with your curiosity, which has been piqued by an unusual invitation from a whole new crew -- and someone you find absolutely delectable. This is where it gets interesting. The only way to do this is to find the time -- and energy -- for both. Can you do it? Ha! Was there ever any doubt?"},
{"sign": "pisces", "day": "yesterday", "horoscope": "You've definitely had your hands full lately -- full of secrets. Now, you've always enjoyed intrigue, but there comes a point when secret meetings, secret admirers, and secret conversations get to be a bit too, well, 'secretive' -- especially if you're duty-bound to keep quiet about it. Fortunately, there's no one more trustworthy, or more compassionate, than you are. Those qualities will guide you now. That, and your conscience."},
{"sign": "virgo", "day": "yesterday", "horoscope": "You're due for some serious changes on the job, and you'll see a hint of what's coming soon -- but there's no need to worry about it. The higher-ups who've had their eyes on you are already quite pleased. In fact, it might just be time for a big, fat raise or a brand new title. Better make plans for the celebration now, because it's due to be a big one."},
{"sign": "scorpio", "day": "yesterday", "horoscope": "Prepare yourself for your authority figures -- the elder ones, in particular -- to be especially demanding, for at least a day or so. Oddly enough, you'll also need to make some time to tend to the needs of your family members. No, this won't be easy -- so you'd better get started. Make lots of lists, and don't be afraid to ask a friend for help."},
{"sign": "libra", "day": "yesterday", "horoscope": "Ready for yet another day of romance, sidelong glances and sweet stuff in general? Sure you are. It's your sign's job, and you'd better prepare yourself because this could well continue for quite some time -- especially if you've just been introduced to someone via a family member. See how important it is to keep an open mind? The last time they tried to fix you up, it turned out to be disastrous, but this time -- well, this time can obviously end up quite differently."},
{"sign": "sagittarius", "day": "yesterday", "horoscope": "You're in that mood -- the one that makes your friends either avoid you or cancel their appointments to spend all their time with you, depending on their general dispositions. You're after nothing less than entirely new experiences, and you're not afraid to speak your mind to anyone who suggests that you should be less reckless -- regardless of whether they're offended or shocked by what you say or do. What fun!"},
{"sign": "taurus", "day": "today", "horoscope": "That new -- and quite authoritative -- person you've met is probably quite well-outfitted at this point, from head to toe. They'll enjoy spending money, but if you want to keep up, better check the balance on your credit cards -- and balance your checkbook. If you can't quite keep up, don't try. There are better ways to impress them, but even if you end up doing some serious damage to your plastic, think of it as a lesson."},
{"sign": "cancer", "day": "today", "horoscope": "The heavens are primed for encounters of the most delightful kind, and there's a touch of extremely unexpected romance in the air, too. This is a lovely combination, no matter what sign yours happens to be. In your case, however -- especially if there's someone you've been secretly thinking about, and you're wondering if they're doing the same -- the news is particularly good. Don't be surprised if you receive an answer to that question, via a startling coincidence that brings you two together."},
{"sign": "gemini", "day": "today", "horoscope": "Whether it feels comfortable to you or not -- and initially, at least, it probably won't -- you're going to be at center stage for a couple of days, and maybe longer. Better accept it, and try to get your sweetheart used to the idea, too, because if they're in the vicinity, they may also find the spotlight trained on them. Of course, there are definitely worse things than being worshipped by a crowd of admirers. Looks like you'll both just have to buck up and smile pretty."},
{"sign": "virgo", "day": "today", "horoscope": "It's indisputable that you have a way with words -- a gift for presenting logical, practical arguments that are awfully hard to disagree with. That talent will come through for you beautifully now, as always, especially at work, and especially if you add just a touch of charm to the mix when you're chatting with coworkers. After all, you know what they say about bees and honey. Buzz..."},
{"sign": "capricorn", "day": "yesterday", "horoscope": "You can feel it, can't you? It's time to spend some money -- a lot of it. Now, impulse shopping is the very last thing on earth your sign will ever be known for. However, for the next day or so, instead of being a friend's 'designated Visa chaperone,' you may need to hire someone to play the part for you. Careful, though: If you surrender your plastic to someone who's truly dedicated, you'll have to do some fancy talking to get it back."},
{"sign": "aquarius", "day": "yesterday", "horoscope": "You love having fun and celebration is the name of your sign's game today. That said, you should also expect for all your sign's 'usual' traits to be doubly potent: rebelliousness, outrageousness and an even more eager willingness to shock and amaze the masses in any way you can. Talk about a good time! Oh, and you've also got a heavenly pass to startle your family right now -- which, honestly, has always been your favorite pastime."},
{"sign": "libra", "day": "today", "horoscope": "If you're still thinking about travel, today's astrological lineup will make it just about impossible for you to resist any longer. Make the decision. You don't even have to decide exactly where you're going -- not just yet. All you really have to do, at this point, is to inform the powers that be that you'll need some time off. Once that's done, it will make the situation real and put you in the mood to choose your destination. Oh, go ahead."},
{"sign": "sagittarius", "day": "today", "horoscope": "It's over -- temporarily, at least. That work binge you were on has finally come to an end. That's not to say that you won't be putting in your time and continuing to do what's necessary to keep your head above water and your reputation on the job intact -- but you may also suddenly find that you need to make time for your siblings and neighbors. Reintroduce yourself to them, and rest assured that you'll receive an extremely warm reception."},
{"sign": "capricorn", "day": "today", "horoscope": "After all the good work you've done lately, asking for that raise, bonus or promotion should be a piece of cake. You're confident that you've earned it, but as usual, you're feeling a bit on the humble side and wondering why they haven't yet offered it to you. Well, remember that old adage about the squeaky wheel getting the grease? It's true. Step right up, tell your superiors that you deserve this, and do it in a startling, sudden fashion. They'll admire your tenacity."},
{"sign": "aquarius", "day": "today", "horoscope": "You've always been the objective type, far more prone toward facts and figures than anything that even remotely resembles nostalgia. At the moment, however, you're feeling like a regular tissue commercial -- and not at all shy about spouting phrases, you would have made fun of not too long ago. It all comes down to just one thing: That love is, indeed, grand, and that you're not afraid to express it."},
{"sign": "pisces", "day": "today", "horoscope": "The universe has officially granted you 'off duty' status. Your compassion knows no bounds, but you've done absolutely everything you can for the ones you love. It's time now for them to take care of themselves -- and for you to stop feeling guilty about not being able to do more. Besides, there's someone out there who could do with a bit more of your time and attention -- not to mention your company, in private. How about it?"},
{"sign": "taurus", "day": "tomorrow", "horoscope": "The past week has been busy, varied and full of choices. As such, you've been hitting it hard for a while now, doing your job, and someone else's, too -- and that's just in the department of work. Home and family, friendships and money matters have also been quite taxing, if you'll pardon the pun. Believe it or not, though, someone has seen what you've done, and the recognition you deserve -- the recognition you never asked for or thought of -- is en route. Kudos!"},
{"sign": "aries", "day": "today", "horoscope": "You're about to begin mingling with all kinds of interesting and unusual people, and you'll love every minute of it. There's at least one new acquaintance en route who'll be around for a while, too, thanks to an astrological setup that will keep that parade of people you'd otherwise never have met going strong. Whether they turn out to be friends or partners is up for grabs, but who cares? Think of this as a social buffet. Treat yourself to just a little taste of everything."},
{"sign": "leo", "day": "today", "horoscope": "If anyone is usually quite sure of what, how and when they want to do what they want to do, it's you. At the moment, however, you're torn between being good (preparing yourself for tomorrow and going to bed early) and being bad -- which would basically entail staying up as late as you like and forgetting about anything but tonight. The final decision, of course, rests with your conscience, but with the right two-legged companion, the right movie and a big bowl of popcorn, there won't be a contest."},
{"sign": "aries", "day": "tomorrow", "horoscope": "Still chatting, mingling, winking and waving at friends you simply can't squeeze into your schedule, and, in general, having quite the time? Bet you are. And with the heavens as full as they are of spontaneous, impetuous astrological energies that are just dying to make change happen, you'd better not take the night off. If you missed something, you'd never forgive yourself."},
{"sign": "cancer", "day": "tomorrow", "horoscope": "For some time now, you've had your suspicions -- and thanks to a comment someone seems to have let slip, you've got even more now. What you're wondering about isn't a bad thing, though. You have the feeling that someone is planning something delightful for you, and you're probably right. Just don't do anything to ruin the surprise. This has probably been some time in the making -- and it may not be finished. Ssh!"},
{"sign": "libra", "day": "tomorrow", "horoscope": "You're so darned happy you're bubbling over. You're in love, and they're all you can possibly think of. Great -- but please, please, please try to go easy on the rest of the world when you can't stop thinking about how cute they looked when they 1) ate breakfast, 2) stood up after breakfast or 3) remembered to kiss you goodbye. Your friends are becoming nauseous at the very mention of their name. Do yourself a favor: Buy a journal and use it."},
{"sign": "scorpio", "day": "tomorrow", "horoscope": "You've been far too good for far too long, which is not at all the way things should be. For a while, you've been watching every penny like a hawk. Fortunately, that means you may have accumulated a few more, which may also mean it's time to stop being quite so neurotic about it. Why not bust open the piggy bank and have some fun? Just a little: Call the dearest of your dears and suggest an evening out."},
{"sign": "sagittarius", "day": "tomorrow", "horoscope": "Talking you into recreation, getting together with your playmates or just going out for the heck of it has never been an especially difficult task. That goes double today. You've been good -- well, relatively good -- for a long time now. Days, even. Maybe weeks. Anyway, it's time to treat yourself to something extra special. To celebrate how good you've been. See? It all makes perfect sense."},
{"sign": "capricorn", "day": "tomorrow", "horoscope": "Bet you've thought of nothing else for days but spending some quality time at home alone with yourself. You're not antisocial, but the world and its inhabitants have definitely taken their toll on you. When you least expect it, however, your mood may change. So -- should you call everyone you turned down and say you changed your mind, or stay in because you said you would? Is that question even worth asking? Get dressed while you're dialing."},
{"sign": "pisces", "day": "tomorrow", "horoscope": "Making someone's day has always been one of your favorite things to do. You'll have a chance to do it for someone today -- someone who really needs a break, a hug, a boost and a smile. The good news is that without them even having to mention it, you'll use those ultra-sensitive antennae of yours to figure out exactly what they need -- and of course, you'll have it waiting for them."},
{"sign": "scorpio", "day": "today", "horoscope": "You've been thinking about letting a certain person know just how much you care -- in fact, you've been thinking about doing that for some time now. You're right on the verge of having a 'state of the relationship' meeting to tell them how you feel. Well, what's the holdup? You know they feel the same and you know they'll be delighted to hear it. You've even got the perfect heavenly envoy on duty, right now: The lovely lady Venus is on your side. What could be better?"},
{"sign": "leo", "day": "tomorrow", "horoscope": "You know that way you have with words? The way you can make even an insult sound kind of like a compliment? It's called verbal charm, and it's going to be even more lethal now, so be careful where you fling any casual comments, because it may not be taken that way -- and then there'll be that messy 'afterward' to clean up. Remember, you may think you're flirting, but to them, it's the signal they've been waiting for."},
{"sign": "gemini", "day": "tomorrow", "horoscope": "The rest of the population here on planet number three is all -- finally -- in the same mood you're always in: ready to chat, laugh, let go and have some fun. By way of proof, you've got plenty of interesting invitations to extend and accept. One, in particular, may involve a long-distance friend or lover -- and you'll do whatever it takes to accept that one."},
{"sign": "aquarius", "day": "tomorrow", "horoscope": "All kinds of really interesting people have been crossing your path lately -- for weeks. There's one more due, too -- someone who's recently been introduced to you by a friend. Oddly enough, this person could actually turn out to be quite important to you -- and to play a major role in your life. Just don't start worrying about your precious freedom. Bet they value theirs just as much as you do yours."},
{"sign": "virgo", "day": "tomorrow", "horoscope": "Did you wake up in the mood to redecorate? Again? You've probably been fighting off this urge for some time now -- but if you can manage it, stop fighting it. Do it to it! Add a room, change a room or pick up a stack of real estate brochures. The catch is this: What you're after right now is a place that's completely and totally pleasing to you, aesthetically speaking. Start now -- and don't stop until it's yours."}
]