[
{"sign": "aries", "day": "yesterday", "horoscope": "Today you should have a lot of vitality, Aries. Recently, you may have decided to take more matters into your own hands. Your relationships will only benefit from this decision. The conflicts you've had to deal with were generally based on a lack of understanding. You sometimes have to make compromises. Try not to be too demanding."},
{"sign": "taurus", "day": "yesterday", "horoscope": "Your generosity and altruism will be put to the test over the next few days, Taurus. You'll probably help the underprivileged. After all, you've always felt concerned about humanitarian projects but have never gotten involved. Today this attitude will enable you to understand who you really are. You'll be able to learn a lot about your motivations and the keys to your success."},
{"sign": "libra", "day": "yesterday", "horoscope": "Today's celestial configuration will be favorable to changes in your relationships, Libra. Your professional and private lives will be influenced by how well you deal with these relationships. You may have decided that in one way or another your behavior needs to change. Now it's time for you to act. Don't be discouraged if it takes a while to see lasting improvement."},
{"sign": "gemini", "day": "yesterday", "horoscope": "Today's aspects will influence you to interact naturally with your circle of friends, Gemini. You're tired of hiding your feelings. You want to act in the way your instincts guide you. However, you're afraid of other people's reactions. Sometimes you don't express your emotions or opinions simply because you're afraid of what they might say or think. Try to gain more self-confidence."},
{"sign": "scorpio", "day": "yesterday", "horoscope": "You've felt the need to create over the past several days, Scorpio. This attitude is certainly due to the planetary positions, but it could also underlie your desire to change your professional and private lives. Therefore, you should let your creative mind come out. How about writing poetry or enrolling in a ceramics class? Don't refrain from showing this secret part of your personality to those closest to you."},
{"sign": "virgo", "day": "yesterday", "horoscope": "Even though the times are favorable for relaxation, you won't be able to fully enjoy this period, Virgo. You'll instead try to adjust your agenda so you can lead a more balanced life. The planetary aspects in play will incite you to change your attitude toward work. You should try to lighten your responsibilities to avoid stress at the office."},
{"sign": "leo", "day": "yesterday", "horoscope": "Unfortunately, today's planetary energy will place you in a rather uncomfortable situation, Leo. You'll be the one having to smooth things over with your group of friends. Try not to impose your point of view. On the contrary, you should try to become more diplomatic and gentle with the people around you. You could also learn a lot by observing how people behave."},
{"sign": "capricorn", "day": "yesterday", "horoscope": "Over the last few weeks you've been working hard so you don't have to worry about your finances, Capricorn. Try to forget your problems, and especially avoid focusing on and talking about money today. Do what you feel like doing. You're probably already aware that you need to take care of yourself from time to time. Don't neglect your health."},
{"sign": "pisces", "day": "yesterday", "horoscope": "Today you'll question yourself about your private life, Pisces. Indeed, you have to change your behavior. You're used to making decisions just for yourself. Now you'll realize that you need to think not only about yourself but also about your partner. This phase in your relationship is difficult and will lead to drastic measures. You now have to assume your responsibilities."},
{"sign": "aries", "day": "today", "horoscope": "Today you should be feeling especially intuitive, particularly where family members are concerned, Aries. It certainly won't be easy for anyone to lie to you. You might also think about making some repairs to your home, which you may have been putting off. You might spend at least part of the day alone meditating or contemplating your future. Your mind is clear and active, so this is a good time to do it."},
{"sign": "aquarius", "day": "yesterday", "horoscope": "Today you're about to put your sense of humor to the test, Aquarius. You'll likely confront a few unexpected situations. Even if you're used to finding exciting things to do in an ordinary world, you'll be in for a big surprise or two. Today there will be a lot of excitement where you least expect it. Try to let the day's energy guide you."},
{"sign": "sagittarius", "day": "yesterday", "horoscope": "When you feel that your friends are trying to change your everyday life, you shouldn't try to resist it so stubbornly, Sagittarius. Open up your heart and let yourself be led. You'll be surprised at the feeling of freedom this brings. You'll probably have some interesting encounters today. They might change your life completely. Get ready for an exciting day!"},
{"sign": "cancer", "day": "today", "horoscope": "Today you might receive a visit or phone call from a friend you haven't seen for a while. An intense and emotional conversation could follow, Cancer. Stimulating news could have you preoccupied for a while. Spiritual activities could also take up much of your time. Listening to someone speak might cause you to feel more insightful than usual. This will enable you to apply good common sense to abstract concepts."},
{"sign": "leo", "day": "today", "horoscope": "You generally enjoy philosophy, metaphysics, and other forms of higher thought, Leo, but today you could find yourself almost obsessive about them. You might decide to sequester yourself and concentrate on these concepts. This is a great day to do this, because intellect combines with intuition to enable you to understand and make sense of abstract ideas. You can apply them to your everyday life. Go to it."},
{"sign": "cancer", "day": "yesterday", "horoscope": "You're defining new strategies concerning your private life, Cancer. You could be feeling like a completely different person today. You're no longer afraid of society, and you enjoy meeting people. You'll probably sympathize with the goals of an individual or a group of people you have recently met. Try to fulfill your needs and forget any preconceived ideas."},
{"sign": "libra", "day": "today", "horoscope": "Today you might decide to help someone with repairs or decorating in their home or perhaps a church or school. You'll have a lot of good ideas welling up from deep within you, Libra, and be astute enough to put them to work in the real world. You might not feel much like talking, however. Therefore don't be surprised if communication is more subtle than overt today."},
{"sign": "virgo", "day": "today", "horoscope": "Social events, perhaps involving a group you're affiliated with, could involve discussions of some deep subjects, such as philosophy, metaphysics, science - or all three. Your mind should be quick and sharp today, Virgo, on both a logical and an intuitive level. You'll probably soak up just about everything you hear. You could give it a lot of thought, and yes, you should be able to make sense of it all."},
{"sign": "sagittarius", "day": "today", "horoscope": "An increased psychological awareness and heightened intuition could have you tuning in to the thoughts and feelings of family members before they even know what they want, Sagittarius. You might be able to pick up the thoughts of strangers. This is the day to trust your inner voice, especially when it comes to making plans with others. While this atmosphere lasts, they might not be too communicative or inclined to say what they want."},
{"sign": "scorpio", "day": "today", "horoscope": "An engagement with a current or potential romantic partner could involve a lot of communication on a subtle level, enjoying each other's company while not saying much. You're likely to feel especially passionate today, Scorpio. Buy yourself some new clothes and look your best. Your aesthetic sense is especially high right now. You could also give some thought to artistic projects. Inspiration could be all around you."},
{"sign": "aquarius", "day": "today", "horoscope": "Others, particularly family members, might be rather quiet today. It could seem as if everyone is running around like crazy but not sharing what's on their minds. You'll have to trust your intuition when you need to know what they're up to, Aquarius. Writing could come from deep within, whether through letters, poetry, or novels, allowing you to express a facet you don't often see. Use this spiritual gift and dig deeper."},
{"sign": "pisces", "day": "today", "horoscope": "Communication, particularly with family members and romantic partners, could take place more subtly than verbally today. Nonetheless, Pisces, you'll sense strong love and support from e one. Romance, especially, should be intense and sensual, so this is a great day to schedule an evening alone with a lover. Inspiration for creative projects, particularly in the home, could well up from deep inside. Don't suppress it - let it flow."},
{"sign": "taurus", "day": "tomorrow", "horoscope": "Matters involving creativity, romance, and children could require considerable thought today, Taurus. Some exciting new options may be available to you and your loved ones. You might be inclined to mull over the possibilities. You could consult others to get more opinions. For the most part, you'll want to decide on your own. In the meantime, you could keep yourself occupied by working on ongoing projects."},
{"sign": "gemini", "day": "tomorrow", "horoscope": "Matters involving the home could suddenly grow serious. This is a positive development, Gemini, but new possibilities could be opening up and force you to make a decision. The value of your home could have gone up and you might consider selling it and moving. Or you could have the opportunity to work out of your home and save commuting costs. Whatever it is, you've reached a milestone. Weigh the pros and cons."},
{"sign": "taurus", "day": "today", "horoscope": "A group you're affiliated with could meet today, perhaps in your neighborhood, Taurus. You should focus more on listening to what they have to say than on actively participating in discussions. You'll want to absorb every idea that comes up and seriously mull it over before expressing yourself. When you communicate, you should do it freely and openly. Your mind is both intuitive and logical, so expect to learn a lot."},
{"sign": "gemini", "day": "today", "horoscope": "A small gathering, perhaps in your home, could bring up the subject of the world economy and what it's going to mean to individuals. You could be contemplating and maybe even discussing your financial future. This is a good time to make such plans, Gemini, as your mind is logical and intuitive today. Write down any ideas or insights that come your way. You'll want to remember them later."},
{"sign": "cancer", "day": "tomorrow", "horoscope": "Today you might consider entering into a business partnership with a relative or neighbor. This could show promise of success, Cancer, and is definitely worth serious consideration. You'll want to be sure it's right for you, so caution is recommended. You might even get around to considering the nitty-gritty of a possible agreement, but for the most part, it isn't likely that you'll be making any final decisions yet."},
{"sign": "leo", "day": "tomorrow", "horoscope": "The value of any investment you may have made in land, including your home, could come into your thoughts today. Whatever time and energy you've put into it is likely to pay off, Leo, and this might make a difference to you when formulating plans for the future. You might spend some time working outside, which should clear your head and enable you to get your thoughts together. A female friend could join you."},
{"sign": "virgo", "day": "tomorrow", "horoscope": "A partnership of some kind, perhaps business, perhaps romantic, is likely to be on your mind today. You might want to seriously consider whether or not it has a future, and if it does, what to do next. You could spend time socializing, Virgo, but you could be too preoccupied to participate much. A lot of serious decisions need to be made. The outcome is likely to be positive. Try to relax and have some fun."},
{"sign": "libra", "day": "tomorrow", "horoscope": "A lot of serious matters are on your mind, perhaps involving plans for the future. It's likely that you'll want to stay home today and do some contemplating. Various new opportunities could be coming your way, Libra, and you won't want to let them pass you by without serious consideration. Chores around the house could prove a valuable outlet for physical energy while allowing thoughts to churn in your mind."},
{"sign": "sagittarius", "day": "tomorrow", "horoscope": "Today much of your mental - and possibly physical - energy could be directed at career matters. You might reevaluate goals and ambitions, Sagittarius, and consider other possibilities. The desire for more income might be the catalyst, but there's more to it than that. This is definitely a good day to think about a number of options. You might have to make a few decisions by this time next week."},
{"sign": "scorpio", "day": "tomorrow", "horoscope": "Contemplation is the word for today. At some point, you might receive a call from a friend wanting advice on a serious decision. Don't be surprised if you spend more time listening than advising, Scorpio. Goals of your own might need some thought and possibly reevaluation, as changes in your immediate environment could present new and exciting possibilities to you. Think about it."},
{"sign": "aquarius", "day": "tomorrow", "horoscope": "Today you're apt to be a bit preoccupied, Aquarius. You might find yourself considering concepts that others think are strange and impractical. This might involve metaphysics or the occult or unusual ways of making a living - or all of the above. You might want to discuss this with others. However, you should make a decision based on your preferences without influence from those who aren't directly involved."},
{"sign": "capricorn", "day": "today", "horoscope": "Social events in your neighborhood could focus on families, with everyone bringing their children. You might spend time telling stories today. Someone with whom you're in contact could be dealing with some powerful emotional issues and not want company. There isn't much you can do, Capricorn. Let the person know you're there and then leave them alone. In the meantime, others are in a festive mood. Have fun."},
{"sign": "aries", "day": "tomorrow", "horoscope": "Career and business matters are likely to be very much on your mind today, Aries. Perhaps a new opportunity has come your way, or you're thinking of becoming involved in a new enterprise on your own or with a partner. This might not be a good day to make a decision, so don't rush it. Before you make any dramatic changes, think things through carefully. You may regret it otherwise."},
{"sign": "capricorn", "day": "tomorrow", "horoscope": "The desire for personal and career advancement could cause you to consider furthering your education in some way, Capricorn. Someone close to you, probably a woman, could wake you up to the advantages of returning to school and getting an advanced degree. You may want to wait a little bit before deciding, but something has shifted within you. It's time for some kind of change. Be prepared."},
{"sign": "pisces", "day": "tomorrow", "horoscope": "Today is likely to be a gratifying day, Pisces, but perhaps more serious than you'd planned. A longtime friend might call and want to get together. This person or another might want to discuss a possible business enterprise that's apt to be worthy of consideration. Everyone around you might seem egocentric, and you could feel that your concerns are of no interest to anyone. Don't let that upset you."}
]